{"pages":[{"title":"About","text":"CMSimfly 內容管理網誌 課程倉儲: https://github.com/chiamingyen/cmsimfly 內容管理: https://chiamingyen.github.io/cmsimfly/ 課程投影片: https://chiamingyen.github.io/cmsimfly/reveal 課程網誌: https://chiamingyen.github.io/cmsimfly/blog","tags":"misc","url":"./pages/about/"},{"title":"網路管理課程W12-W13","text":"五專網際內容管理W12-W13 W12 Leo Editor 與 Pelican blog 使用說明影片 W13 Pelican Blog 內容與 Google Blogger 同步 W13 利用 Leo Editor 按鈕處理同步說明影片 教學影片-2 教學影片-3 利用 Windows 10 設定 -> 選擇預設網頁瀏覽器, 使用 Google Chrome 作為預設瀏覽器. 隨身程式系統必須安裝 google-api-python-client 與 oauth2client pip install google-api-python-client oauth2client OAuth 2.0 client IDs 程式類別可以選擇 Desktop app 使用者完成 client_secrets.json 設定後, 必須將檔案存在倉儲目錄外部 將 client_secrets.json 轉為 credential_token.dat 的程式","tags":"Misc","url":"./Network_ManagementW12W13.html"},{"title":"網路管理課程W14","text":"五專網際內容管理W14 直接在操作系統建立網際內容管理合用系統 Windows 10 64 位元操作系統 安裝 Python 3.8.3 與 pip 安裝 Git 利用 64-bit Git for Windows Setup 安裝 Git 工具. 安裝 CMSiMDE 所需模組 利用 cmd 開啟命令列視窗, 以 pip 安裝 flask flask_cors lxml bs4 markdown pelican leo 等模組 pip install flask flask_cors lxml bs4 markdown pelican leo Ubuntu 20.04 操作系統 (請下載 W12 Virtualbox 虛擬主機檔案) Ubuntu 20.04 同時存在 Python 2.7 與 Python 3.8.2, CMSiMDE 只相容於 Python 3.8.2, 因此啟動指令必須使用: python3 wsgi.py 與 pip3 install flask flask_cors lxml bs4 markdown pelican leo Mac OS X 操作系統 與 Ubuntu 20.04 類似.","tags":"Misc","url":"./Network_ManagementW14.html"},{"title":"電腦硬體","text":"我真的不知道可以打什麼我才打這篇 主機板 主機板是使 PC 運作的核心。位於其上的 CPU 是所有其他硬體運作的樞紐。主機板好比大腦，將電源配送至需要的地方，與其他所有元件溝通協調，是電腦中最重要的硬體之一。 RAM 隨機存取記憶體或 RAM，是指一種安裝在主機板記憶體插槽內的硬體。RAM 的作用是暫時儲存由程式建立的使用中資訊，如此一來這些資料即可立即存取。 硬碟 硬碟是一種儲存裝置，負責儲存永久性和暫時性資料。這些資料有諸多形式，但基本上是將其儲存或安裝至電腦中，例如電腦程式、家庭照片、作業系統、文書處理文件等等。 有兩種不同類型的儲存裝置：傳統硬碟（HDD）和較新的固態硬碟（SSD）。傳統硬碟透過在高速旋轉磁碟（稱之為碟片）上寫入二進位資料，而固態硬碟透過靜態快閃記憶體晶片儲存資料。 GPU GPU 如其名所述，負責處理大量批次的圖像資料，對 3D 算圖尤其重要。您會發現電腦的顯示卡至少有一個 GPU。與 PC 主機板所提供的基本內建顯示功能相反，專用顯示卡介面透過擴充插槽來與主機板連接，幾乎專為顯示算圖所用。這也表示若您想提升一些 PC 效能，可以透過升級顯示卡來完成。 PSU 電源供應器通常縮寫成 PSU，其作用不僅是為電腦供電而已。此為電力從外部電源進入系統的切入點，並從主機板分配給各個硬體元件。不過，並非所有電源供應器皆相同，若 PSU 沒有足夠的瓦數，您的系統將無法正常運作。","tags":"Misc","url":"./PC_hardware.html"}]}